ViaiYi/nano-psdk/samples/sample_c/platform/rtos_freertos/stm32f4_discovery/application/main.c
/**
 ********************************************************************
 * @file    main.c
 * @date    2021/4/23
 * @brief
 *
 * @copyright (c) 2021 DJI. All rights reserved.
 *
 * All information contained herein is, and remains, the property of DJI.
 * The intellectual and technical concepts contained herein are proprietary
 * to DJI and may be covered by U.S. and foreign patents, patents in process,
 * and protected by trade secret or copyright law.  Dissemination of this
 * information, including but not limited to data and other proprietary
 * material(s) incorporated within the information, in any form, is strictly
 * prohibited without the express written consent of DJI.
 *
 * If you receive this source code without DJI’s authorization, you may not
 * further disseminate the information, and you must immediately remove the
 * source code and notify DJI of its removal. DJI reserves the right to pursue
 * legal actions against you for any loss(es) or damage(s) caused by your
 * failure to do so.
 *
 *********************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "application.h"
#include "FreeRTOS.h"
#include "task.h"
#include "core_cm4.h"
#include "flash_if.h"

/* Private constants ---------------------------------------------------------*/
#define USER_START_TASK_STACK_SIZE          2048
#define USER_START_TASK_PRIORITY            0
#define USER_RUN_INDICATE_TASK_STACK_SIZE   256
#define USER_RUN_INDICATE_TASK_PRIORITY     0
#define USER_MYPWM1_TASK_STACK_SIZE         2048
#define USER_MYPWM1_TASK_PRIORITY           0
// #define USER_MYPWM_TASK_STACK_SIZE          512
// #define USER_MYPWM_TASK_PRIORITY            0
// #define USER_MYSPEAKER_TASK_STACK_SIZE      1024
// #define USER_MYSPEAKER_TASK_PRIORITY        0
// #define USER_MYLED_TASK_STACK_SIZE   256
// #define USER_MYLED_TASK_PRIORITY     0

/* Private types -------------------------------------------------------------*/

/* Private values -------------------------------------------------------------*/
static TaskHandle_t startTask;
static TaskHandle_t runIndicateTask;
static TaskHandle_t myPwm1Task;
// static TaskHandle_t mySpeakerTask;
// static TaskHandle_t myLed;

/* Private functions declaration ---------------------------------------------*/
static void SystemClock_Config(void);
void Error_Handler(void);

/* Exported functions definition ---------------------------------------------*/
#ifndef __CC_ARM
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-noreturn"
#pragma GCC diagnostic ignored "-Wreturn-type"
#endif

int main(void)
{
    __disable_irq();
    SCB->VTOR = APPLICATION_ADDRESS;
    __enable_irq();

    /* STM32F4xx HAL library initialization:
         - Configure the Flash prefetch, instruction and Data caches
         - Configure the Systick to generate an interrupt each 1 msec
         - Set NVIC Group Priority to 4
         - Global MSP (MCU Support Package) initialization
       */
    HAL_Init();

    /* Configure the system clock to 168 MHz */
    SystemClock_Config();

    /* Create start task */
    xTaskCreate((TaskFunction_t) DjiUser_StartTask, "start_task", USER_START_TASK_STACK_SIZE,
                NULL, USER_START_TASK_PRIORITY, (TaskHandle_t *) startTask);

    /* Create runIndicate task */
    xTaskCreate((TaskFunction_t) DjiUser_MonitorTask, "monitor_task", USER_RUN_INDICATE_TASK_STACK_SIZE,
                NULL, USER_RUN_INDICATE_TASK_PRIORITY, (TaskHandle_t *) runIndicateTask);

    /*PWM1 task*/
    xTaskCreate((TaskFunction_t) DjiUser_MyPwm1Task, "myPwm1Task", USER_MYPWM1_TASK_STACK_SIZE,
                NULL, USER_MYPWM1_TASK_PRIORITY, (TaskHandle_t *) myPwm1Task);
    /* Create mypwm task */
    // xTaskCreate((TaskFunction_t) DjiUser_MyPwmTask, "mypwm_task", USER_MYPWM_TASK_STACK_SIZE,
    //             NULL, USER_MYPWM_TASK_PRIORITY, (TaskHandle_t *) myPwmTask);

    // /* Create mypwm task */
    // xTaskCreate((TaskFunction_t) DjiUser_MySpeakerTask, "myspeaker_task", USER_MYSPEAKER_TASK_STACK_SIZE,
    //             NULL, USER_MYSPEAKER_TASK_PRIORITY, (TaskHandle_t *) mySpeakerTask);
    // /* Create myled task */
    // xTaskCreate((TaskFunction_t) DjiUser_MyLedTask, "myled_task", USER_MYLED_TASK_STACK_SIZE,
    //             NULL, USER_MYLED_TASK_PRIORITY, (TaskHandle_t *) myLed);
								
    /* Start scheduler */
    vTaskStartScheduler();

    /*Taken by the scheduler */
    for (;;);
}

#ifndef __CC_ARM
#pragma GCC diagnostic pop
#endif

/* Private functions definition-----------------------------------------------*/
/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow :
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 168000000
  *            HCLK(Hz)                       = 168000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = HSE_VALUE
  *            PLL_M                          = HSE_VALUE/1000000
  *            PLL_N                          = 336
  *            PLL_P                          = 2
  *            PLL_Q                          = 7
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 5
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /** Configure the main internal regulator output voltage
    */
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
    /** Initializes the RCC Oscillators according to the specified parameters
    * in the RCC_OscInitTypeDef structure.
    */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE; //RCC_OSCILLATORTYPE_HSE
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;  //RCC_HES_ON
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 4;
    RCC_OscInitStruct.PLL.PLLN = 168;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ = 7;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
//        Error_Handler();
    }
    /** Initializes the CPU, AHB and APB buses clocks
    */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                  | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
//        Error_Handler();
    }
}

/**
 * @brief  Period elapsed callback in non blocking mode
 * @note   This function is called  when TIM1 interrupt took place, inside
 * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
 * a global variable "uwTick" used as application time base.
 * @param  htim : TIM handle
 * @retval None
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    /* USER CODE BEGIN Callback 0 */

    /* USER CODE END Callback 0 */
    if (htim->Instance == TIM1) {
        HAL_IncTick();
    }
    /* USER CODE BEGIN Callback 1 */

    /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
    /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */
    __disable_irq();
    while (1) {
    }
    /* USER CODE END Error_Handler_Debug */
}

/****************** (C) COPYRIGHT DJI Innovations *****END OF FILE****/
